###############################################################################
# Created by write_sdc
# Mon Jul 28 21:23:47 2025
###############################################################################
current_design digital
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name __VIRTUAL_CLK__ -period 10.0000 
set_clock_uncertainty 0.2500 __VIRTUAL_CLK__
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {GND}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VDD}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {clk}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {clr}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {comp_n}]
set_input_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {comp_p}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {GND}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {VDD}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {comp_clk}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {done}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {obit1}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {obit10}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {obit2}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {obit3}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {obit4}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {obit5}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {obit6}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {obit7}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {obit8}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {obit9}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n1}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n2}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n3}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n4}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n5}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n6}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n7}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n8}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n_sp1}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n_sp2}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n_sp3}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n_sp4}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n_sp5}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n_sp6}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n_sp7}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n_sp8}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_n_sp9}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p1}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p2}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p3}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p4}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p5}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p6}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p7}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p8}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p_sp1}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p_sp2}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p_sp3}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p_sp4}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p_sp5}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p_sp6}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p_sp7}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p_sp8}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_p_sp9}]
set_output_delay 2.0000 -clock [get_clocks {__VIRTUAL_CLK__}] -add_delay [get_ports {sw_sample}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {GND}]
set_load -pin_load 0.0334 [get_ports {VDD}]
set_load -pin_load 0.0334 [get_ports {comp_clk}]
set_load -pin_load 0.0334 [get_ports {done}]
set_load -pin_load 0.0334 [get_ports {obit1}]
set_load -pin_load 0.0334 [get_ports {obit10}]
set_load -pin_load 0.0334 [get_ports {obit2}]
set_load -pin_load 0.0334 [get_ports {obit3}]
set_load -pin_load 0.0334 [get_ports {obit4}]
set_load -pin_load 0.0334 [get_ports {obit5}]
set_load -pin_load 0.0334 [get_ports {obit6}]
set_load -pin_load 0.0334 [get_ports {obit7}]
set_load -pin_load 0.0334 [get_ports {obit8}]
set_load -pin_load 0.0334 [get_ports {obit9}]
set_load -pin_load 0.0334 [get_ports {sw_n1}]
set_load -pin_load 0.0334 [get_ports {sw_n2}]
set_load -pin_load 0.0334 [get_ports {sw_n3}]
set_load -pin_load 0.0334 [get_ports {sw_n4}]
set_load -pin_load 0.0334 [get_ports {sw_n5}]
set_load -pin_load 0.0334 [get_ports {sw_n6}]
set_load -pin_load 0.0334 [get_ports {sw_n7}]
set_load -pin_load 0.0334 [get_ports {sw_n8}]
set_load -pin_load 0.0334 [get_ports {sw_n_sp1}]
set_load -pin_load 0.0334 [get_ports {sw_n_sp2}]
set_load -pin_load 0.0334 [get_ports {sw_n_sp3}]
set_load -pin_load 0.0334 [get_ports {sw_n_sp4}]
set_load -pin_load 0.0334 [get_ports {sw_n_sp5}]
set_load -pin_load 0.0334 [get_ports {sw_n_sp6}]
set_load -pin_load 0.0334 [get_ports {sw_n_sp7}]
set_load -pin_load 0.0334 [get_ports {sw_n_sp8}]
set_load -pin_load 0.0334 [get_ports {sw_n_sp9}]
set_load -pin_load 0.0334 [get_ports {sw_p1}]
set_load -pin_load 0.0334 [get_ports {sw_p2}]
set_load -pin_load 0.0334 [get_ports {sw_p3}]
set_load -pin_load 0.0334 [get_ports {sw_p4}]
set_load -pin_load 0.0334 [get_ports {sw_p5}]
set_load -pin_load 0.0334 [get_ports {sw_p6}]
set_load -pin_load 0.0334 [get_ports {sw_p7}]
set_load -pin_load 0.0334 [get_ports {sw_p8}]
set_load -pin_load 0.0334 [get_ports {sw_p_sp1}]
set_load -pin_load 0.0334 [get_ports {sw_p_sp2}]
set_load -pin_load 0.0334 [get_ports {sw_p_sp3}]
set_load -pin_load 0.0334 [get_ports {sw_p_sp4}]
set_load -pin_load 0.0334 [get_ports {sw_p_sp5}]
set_load -pin_load 0.0334 [get_ports {sw_p_sp6}]
set_load -pin_load 0.0334 [get_ports {sw_p_sp7}]
set_load -pin_load 0.0334 [get_ports {sw_p_sp8}]
set_load -pin_load 0.0334 [get_ports {sw_p_sp9}]
set_load -pin_load 0.0334 [get_ports {sw_sample}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {GND}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {VDD}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clr}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {comp_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {comp_p}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
